content-org/posts/all-posts.org
#+hugo_base_dir: ../../
#+hugo_section: posts
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval no

#+startup: indent
#+startup: content

# https://ox-hugo.scripter.co/doc/org-meta-data-to-hugo-front-matter/

# Macros
#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@

#+AUTHOR: Louis Tsiattalou

** DONE 19 Months on the Civil Service Fast Stream :Civil__Service:
CLOSED: [2019-05-27 Mon 18:00]
:PROPERTIES:
:EXPORT_FILE_NAME: my-time-on-the-fast-stream
:CUSTOM_ID: my-time-on-the-fast-stream
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type post
:END:

I left the finance systems consultancy world in September 2017, as I had secured
a place on the Civil Service Fast Stream. I figured that, now that I've
"graduated" from the scheme so to speak, I'd put up a post about my experiences
on the scheme.

If you are reading this post-2019 intake, current plans are to change the format
of the fast stream significantly for 2020 onwards. This might not end up
happening, especially since this year has been so politically turbulent with no
end in sight!

*** Operational Research
The term "Operational Researcher" confuses people. It still confuses me. The
profession is not nearly defined as the other analytical professions in the
Civil Service (Economist, Social Researcher and Statistician). Each analytical
profession also has a professional network within the Civil Service, of which
the OR one is the Government Operational Research Service. There's a lot of rich
history that I won't go into here, but at its core, Operational Research is
about applying analytical methods to make better decisions. These techniques
need not necessarily be numerical, they may include softer skills too. Some
techniques include:

- Simulation
- Regression
- Multi-criteria Decision Analysis
- Wargaming
- Constraint Optimization

In my view, Data Science is a related discipline to Operational Research, and
most Operational Research roles have scope for developing Data Science
techniques. This is how I ended up as a Data Scientist; in the Civil Service,
almost everyone with the Data Scientist job title is a Operational Researcher or
a Statistician, and my skills in data engineering landed me quite squarely in
the burgeoning Government Data Science community.

*** My Placements
When I joined the scheme I was placed at the Food Standards Agency in an
Operational Research role, which I quickly adapted into a Data Science role. I
developed visualisation tools for the department, which involved lots of
database automation, frontend development with R (using the =shiny= library),
and automated report writing supporting the FSA's operations and policy
endeavours. While there, I developed the Data Science capability in the
Analytics Unit after initially proving the value it could add.

I then joined the Department for Business, Energy, and Industrial Strategy,
where I was promoted out of the Fast Stream after 7 months. There, I focused
more on stakeholder engagement with the increased responsibility of the role,
as well as model building and software engineering skills.

*** The Fast Stream Structure
Most people do not know that there's significant variation in many of the Fast
Streams that the Civil Service offer. So my comments here should be taken as
specifically referring to the *Operational Research* Fast Stream only; as it is
unique from all others.

There are essentially two main types of Fast Stream - centralised and
non-centralised. Centralised Fast Streams are directly administered by the
Cabinet Office, their fast streamers are officially employed by them, and they
do not get a choice as to what their placements are. Their pay and learning
offers are also standardised across the board. Most fast streams are
centralised. Non-centralised fast streamers are employed by the departments at
which they are placed, have non-standardised pay, but in most cases have some
input as to what their placements are.

*** My Experiences
The scheme as a whole certainly had some positives and some negatives. The
Operational Research Fast Stream is one of the most versatile out of all the
Fast Streams; you have full control of your placement length and your
placements. I used this to great effect, moving on from the Food Standards
Agency when I felt that I had learned as much as I could from that placement
(less than the standard 1-1.5 year placement), and moved to a department where I
could continue building on my technical skills while engaging more with policy
colleagues and line managing other Data Scientists.

Another thing I loved about the scheme was the network with other GFSAs (GORS
Fast Stream Analysts). There's a fantastic community of other OR Fast Streamers
I spent a lot of time engaging with, for work stuff and socials too. Lots of my
best friends in government belong in that group, and it can't really be
understated how important it is in your early career to have a strong network of
your peers for support and to socialise with.

However, it wasn't all sunshine and rainbows. Due to its non-centralised
status, the key aspects of being a "fast stream" are largely luck of the draw
for your first placement. Particularly, one's experiences with the following
three aspects of this /development programme/ can be poor compared to other fast
streamers (and wildly inconsistent between placements within the OR fast stream itself):
- Pay
- Learning & Development Opportunities
- Quality of Work
For instance, analysts who ended up at DEFRA (Department for Environment, Food
and Rural Affairs) for their first placement were being paid nearly £10,000 less
than analysts at the Home Office until they moved, purely based on differences
interdepartmental payscales. This is a raw deal for the DEFRA analysts, but
centralised fast streamers are all paid the same wage, and it's significantly
lower than the median pay reward for the Operational Research Fast Stream, so
this variation isn't necessarily a bad thing. Similar disparities in L&D
opportunities and interdepartmental support networks also exist. The quality of
the roles themselves also have pretty wild variation, but this is inevitable
for a fast stream covering such a broad church of a profession like OR.

Ultimately, there isn't that much of a difference between being a main-stream
and fast-stream Operational Researcher, particularly for 1st to 2nd year fast
streamers (at which point many opt to leave for main stream SEO-level roles;
better pay and more responsibility, but no rotation mechanism). The main benefit
I found was the network of other GFSAs, but I was lucky enough to be placed at
the Food Standards Agency as my first placement, which had good pay and
excellent L&D opportunities.

If I was to do it all over again? I'd say I got a lot out of the Fast Stream,
but I wouldn't stay on it for the expected 4 years. I was lucky enough to get
promoted out of the fast stream relatively early; had I stayed on longer than
two years, I'd have definitely looked for SEO-level opportunities, which are
effectively the same jobs as 3rd/4th year fast streamers, but with a
£6,000-10,000 pay increase. This was my experience of the fast stream as it
existed between 2011-e.t.a 2020, so many of these problems might have been
rectified or mitigated by the Fast Stream Transformation programme.

*** Outline :noexport:
**** My Experiences in Particular
**** General Impressions
- Honest impressions of the scheme as a whole
- Operational Research Fast Stream; different from normal fast streams.
- Strengths:
  - Network
  - Community
  - Work opportunities
  - Pride in the discipline and its approach
- Weaknesses:
  - Learning & Development hugely lacking.
  - Ridiculously long recruitment process
  - Pay is drastically different across the board (some cases hugely
    uncompetitive and therefore no talent).
  - Many departments don't have a defined end point to the fast stream. Most
    simply apply, interview for, and get clearance for G7 levels.
- Ultimately not all that different from the deal that the Main Streamers get,
  possibly worse due to the pay differential between HEO and SEO level roles and
  the Fast Stream role.
